# Usage:
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# brew bundle --global

brew "clang-format"
brew "cmake"
brew "codespell"
brew "cppcheck"
brew "doxygen"
brew "ffmpeg"
brew "gcc"
brew "gifsicle"
brew "git"
brew "htop"
brew "imhex"
brew "lcov"
brew "llvm"
brew "make"
brew "midnight-commander"
brew "ncdu"
brew "neovim"
brew "ninja"
brew "pass"
brew "podman"
brew "tldr"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "vim"

cask "android-studio"
cask "appcleaner"
cask "cyberduck"
cask "dbeaver"
cask "discord"
cask "firefox"
cask "gimp"
cask "google-chrome"
cask "imhex"
cask "inkscape"
cask "kdenlive"
cask "kitty"
cask "krita"
cask "mpv"
cask "nextcloud"
cask "obsidian"
cask "qbittorrent"
cask "sublime-text"
cask "sweet-home3d"
cask "telegram"
cask "the-unarchiver"
cask "transmission"
cask "yandex"
