# Usage:
# /bin/bash -c "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/HEAD/install.sh)"
# brew bundle --global

brew "clang-format"
brew "cmake"
brew "codespell"
brew "cppcheck"
brew "doxygen"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gifsicle"
brew "go"
brew "htop"
brew "lcov"
brew "llvm"
brew "midnight-commander"
brew "neovim"
brew "ninja"
brew "node"
brew "pass"
brew "podman"
brew "ripgrep"
brew "staticcheck"
brew "tldr"
brew "tmux"
brew "tree"
brew "universal-ctags"

cast "android-studio"
cask "appcleaner"
cask "discord"
cask "firefox"
cask "gimp"
cask "google-chrome"
cask "kitty"
cask "krita"
cask "qbittorrent"
# cask "qt-creator"
cask "redream"
cask "sweet-home3d"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
case "yandex"
